{
  "backend/main.mo": "Empty Motoko actor with no backend logic.",
  "feature_evidence.json": "Metadata describing a feature update replacing the Contact page content and listing related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend files including pages, layout components, content modules, and config files.",
  "frontend/index.css": "Tailwind base/style layers defining CSS variables for light/dark themes with a warm color palette.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up the TanStack Router with all site routes and renders the RouterProvider.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer with branding, quick links, disclaimer, and caffeine.ai attribution.",
  "frontend/src/components/layout/SiteHeader.tsx": "Responsive header with navigation links, logo, mobile menu, and Get Help Now button.",
  "frontend/src/components/layout/SiteLayout.tsx": "Page layout wrapper including header, footer, and routed content outlet.",
  "frontend/src/content/education.ts": "Structured educational content definitions for multiple addiction-related sections.",
  "frontend/src/content/resources.ts": "Defines a Resource interface, emergency disclaimers, and a list of crisis, treatment, support, and information resource entries.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity, refreshing queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication, including login, logout, and identity loading.",
  "frontend/src/hooks/useQueries.ts": "Empty module indicating no backend queries are needed for this static site.",
  "frontend/src/index.css": "Tailwind CSS setup defining global styles, color variables, light/dark themes, and base typography rules.",
  "frontend/src/main.tsx": "Bootstraps the app by rendering React with QueryClient and InternetIdentity providers.",
  "frontend/src/pages/About.tsx": "Renders the About page with mission, approach, audience details, and a disclaimer section.",
  "frontend/src/pages/Contact.tsx": "Displays India-specific contact details including email, Instagram, and a link to resources.",
  "frontend/src/pages/Faq.tsx": "Provides an FAQ list about addiction, recovery, treatment, and related topics using an accordion UI.",
  "frontend/src/pages/Home.tsx": "Landing page with hero banner, feature cards, and links to key educational and support resources.",
  "frontend/src/pages/HowToSupportSomeone.tsx": "Renders education content on supporting someone with addiction, including alert guidance and sectioned cards.",
  "frontend/src/pages/RecoveryBasics.tsx": "Displays recovery basics education content using cards for each subsection.",
  "frontend/src/pages/RelapseNextSteps.tsx": "Shows relapse guidance with an alert and detailed recovery steps from the education content.",
  "frontend/src/pages/Resources.tsx": "Lists crisis, support, treatment, and information resources with emergency notice and categorized cards.",
  "frontend/src/pages/SignsRiskFactors.tsx": "Presents signs and risk factors for addiction using structured sections from education content.",
  "frontend/src/pages/WhatAddictionIs.tsx": "Provides an overview of addiction with introduction and detailed educational subsections.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, animations, and container settings.",
  "project_state.json": "Defines the website’s project state, versioning, features, and architectural notes for an informational addiction‑recovery site. Lists required sections, design constraints, and contact‑page guidelines."
}