{
  "backend/main.mo": "Empty Motoko actor with no backend logic.",
  "feature_evidence.json": "Metadata describing a feature update targeting the Contact page email address.",
  "frontend-file-summaries.txt": "Auto-generated summaries of all frontend files and their purposes.",
  "frontend/index.css": "Tailwind base and theme variables defining light/dark color palettes and global styles.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up the TanStack Router with all routes and renders the RouterProvider.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer with branding, quick links, disclaimer, and caffeine.ai attribution.",
  "frontend/src/components/layout/SiteHeader.tsx": "Responsive header with navigation, logo, and mobile menu handling.",
  "frontend/src/components/layout/SiteLayout.tsx": "Page layout wrapper providing header, footer, and Outlet for routed pages.",
  "frontend/src/content/education.ts": "Typed content definitions for all educational sections with structured text and bullets.",
  "frontend/src/content/resources.ts": "Defines a Resource interface, crisis-related text constants, and an array of crisis, support, treatment, and information resources.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor using react-query, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity auth context and provider, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder module indicating no backend queries are needed.",
  "frontend/src/index.css": "Configures Tailwind styles and CSS variables for light and dark themes with warm color palettes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/About.tsx": "Renders an About page with mission, approach, audience sections, and a disclaimer.",
  "frontend/src/pages/Contact.tsx": "Displays email and Instagram contact info plus a link to the resources page.",
  "frontend/src/pages/Faq.tsx": "Provides an FAQ list about addiction, treatment, and recovery using an accordion UI.",
  "frontend/src/pages/Home.tsx": "Landing page with hero section, feature cards, and links to key educational and resource pages.",
  "frontend/src/pages/HowToSupportSomeone.tsx": "Loads education content for supporting someone and displays it using alert and card sections.",
  "frontend/src/pages/RecoveryBasics.tsx": "Renders recovery basics education content in a series of cards with headings and optional bullet lists.",
  "frontend/src/pages/RelapseNextSteps.tsx": "Displays relapse guidance with an informational alert and structured education content sections.",
  "frontend/src/pages/Resources.tsx": "Organizes crisis, support, treatment, and information resources into categorized card sections with links.",
  "frontend/src/pages/SignsRiskFactors.tsx": "Shows signs and risk factors education content dynamically using cards and bullet lists.",
  "frontend/src/pages/WhatAddictionIs.tsx": "Presents foundational information about addiction using structured education content cards.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom colors, fonts, animations, and plugin setup.",
  "project_state.json": "Project state metadata including feature requests, domain plans, and site summary."
}