{
  "backend/main.mo": "Main Motoko actor implementing seminar form submission and user profile management with role-based access control (admin/user permissions) using AccessControl and MixinAuthorization modules.",
  "feature_evidence.json": "Feature evidence report documenting the removal of the login button from SiteHeader while preserving Internet Identity authentication functionality in the background.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including pages, components, content modules, and configuration files for the addiction awareness seminar website.",
  "frontend/index.css": "Global Tailwind CSS styles defining OKLCH color system variables for light and dark themes with warm earth tones and enhanced form field focus states.",
  "frontend/index.html": "HTML entry point with Google Search Console verification meta tag and root div for React SPA mounting.",
  "frontend/public/robots.txt": "Robots.txt allowing all crawlers and referencing the sitemap location for SEO.",
  "frontend/public/sitemap.xml": "XML sitemap listing all public informational pages with priorities and change frequencies, excluding admin routes from indexing.",
  "frontend/src/App.tsx": "Main React app with TanStack Router configuration defining routes for all informational pages, contact, about, and admin submissions.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Access denied UI component displaying a shield alert icon, error message, and return-to-home button for unauthorized admin page access attempts.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button component using Internet Identity authentication with loading states and query cache clearing on logout.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer component with branding, quick links navigation, disclaimer section, copyright notice, and Caffeine.ai attribution with UTM tracking.",
  "frontend/src/components/layout/SiteHeader.tsx": "Site header component with responsive navigation, logo, menu links for education pages, conditional admin link for authenticated admins, and a 'Get Help Now' button.",
  "frontend/src/components/layout/SiteLayout.tsx": "Main layout wrapper component that renders the site header, an outlet for child routes, and the site footer in a flex column layout.",
  "frontend/src/components/seminar/SeminarRegistrationForm.tsx": "Form component for seminar registration that collects name, institution, position, and date, submits via a custom hook, and displays success/error states.",
  "frontend/src/content/education.ts": "Defines education content structure and exports an array of education sections covering addiction topics like 'What Addiction Is' and 'Signs & Risk Factors' with introductions, headings, content, and bullet points.",
  "frontend/src/content/faqs.ts": "Exports an array of FAQ objects with questions and answers about addiction, recovery, treatment, insurance coverage, and relapse.",
  "frontend/src/content/resources.ts": "Defines resource data structure and exports arrays of crisis, treatment, support, and information resources including helplines, support groups, and government agencies with URLs and phone numbers.",
  "frontend/src/game/ai.ts": "AI opponent logic for a turn-based game that evaluates and selects actions based on game state, difficulty level, and strategic scoring of available moves like attack, defend, gather, and diplomacy.",
  "frontend/src/game/engine.ts": "Defines the core turn-based game engine with initial state, 8 action types (attack, defend, gather, build-shield, build-weapon, diplomacy, sabotage, heal), and the applyAction function that processes actions and updates game state including health, resources, and flags.",
  "frontend/src/game/persistence.ts": "Handles game save/load functionality with localStorage as the primary storage mechanism and placeholder hooks for future backend integration via ICP actor and Principal.",
  "frontend/src/game/types.ts": "TypeScript type definitions for the turn-based game including GameState, ActionType, Action, TurnResult, GameLog, SavedGame, and Difficulty enums.",
  "frontend/src/game/useGame.ts": "React hook that manages game state, executes player and AI actions sequentially, maintains turn history, and provides methods for reset, save, and load operations.",
  "frontend/src/game3d/entities/Obstacles.tsx": "Manages rotating cube obstacles that orbit and bounce within bounds, detecting collisions with the player to trigger life loss with a 1-second cooldown.",
  "frontend/src/game3d/entities/Pickups.tsx": "Renders collectible spheres that rotate and bob vertically, detecting player proximity to award 10 points and mark pickups as collected.",
  "frontend/src/game3d/entities/Player.tsx": "Renders the player cube mesh, processes keyboard controls to move within bounds, updates game state with position changes, and applies gentle rotation animation.",
  "frontend/src/game3d/systems/useKeyboardControls.ts": "React hook that listens to keyboard events (WASD/Arrow keys) and returns a controls object tracking which directional keys are currently pressed.",
  "frontend/src/game3d/ThreeGameCanvas.tsx": "React Three Fiber canvas component that renders the 3D game scene with lighting, fog, ground plane, grid helper, and conditionally renders Player, Pickups, and Obstacles entities when game is playing.",
  "frontend/src/game3d/types.ts": "TypeScript type definitions for the 3D game including Game3DState interface with status, score, lives, player position, and game control methods, plus PickupData and ObstacleData interfaces.",
  "frontend/src/game3d/ui/ControlsHint.tsx": "UI component that displays a card with keyboard icon and text hint showing WASD/Arrow key controls for player movement.",
  "frontend/src/game3d/ui/Game3DOverlay.tsx": "React component that renders the UI overlay for a 3D collection game, displaying HUD elements (score, lives), start screen with instructions, and game over screen with final score.",
  "frontend/src/game3d/useGame3D.ts": "Custom React hook managing 3D game state including status, score, lives, and player position, with callbacks for starting/restarting game, adding score, losing lives, and updating player position.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an authenticated or anonymous backend actor using Internet Identity, initializing access control with admin token and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useAdminSubmissions.ts": "Provides React Query hooks to check if the caller is an admin and fetch all seminar form submissions, both dependent on authenticated actor availability.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout flow, identity state, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Custom hook that fetches the current caller's user profile from the backend actor using React Query.",
  "frontend/src/hooks/useSubmitSeminarRegistration.ts": "React Query mutation hook that submits a simplified 4-field seminar registration form by mapping it to the full backend SeminarFormValues structure and invalidating submissions cache on success.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm earth-toned color palette for light and dark modes, plus base styling for forms, typography, and accessibility.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/About.tsx": "About page component displaying organization mission, approach, and audience information with banner image and card-based layout, founded by Ujjwal Arora in March 2025.",
  "frontend/src/pages/AdminSubmissions.tsx": "Admin dashboard page that displays all seminar registration submissions in a table format, with authentication and authorization checks to ensure only admin users can access the data.",
  "frontend/src/pages/Contact.tsx": "Contact page displaying email and Instagram contact information for India support, with links to reach out and a reference to the resources page.",
  "frontend/src/pages/Faq.tsx": "FAQ page that renders an accordion list of frequently asked questions about addiction and recovery from imported content.",
  "frontend/src/pages/Game.tsx": "Empty component file for a game feature, currently contains no implementation.",
  "frontend/src/pages/Game3D.tsx": "Empty component file for a 3D game feature, currently contains no implementation.",
  "frontend/src/pages/Home.tsx": "Landing page with hero section, seminar information cards, and embedded seminar registration form for the Awareness Over Addiction initiative.",
  "frontend/src/pages/HowToSupportSomeone.tsx": "Educational page providing guidance on how to support someone struggling with addiction, with sections rendered from imported content and an alert emphasizing boundaries.",
  "frontend/src/pages/RecoveryBasics.tsx": "Educational page explaining the basics of addiction recovery, rendering content sections from imported education data in card components.",
  "frontend/src/pages/RelapseNextSteps.tsx": "Educational page about handling relapse in recovery, featuring an important alert that relapse is not failure and rendering guidance sections from imported content.",
  "frontend/src/pages/Resources.tsx": "Comprehensive resources page displaying crisis hotlines, support groups, treatment resources, and information links, organized by category with emergency disclaimer and banner image.",
  "frontend/src/pages/SignsRiskFactors.tsx": "Educational page detailing signs and risk factors of addiction, rendering structured content sections from imported education data.",
  "frontend/src/pages/WhatAddictionIs.tsx": "Educational page explaining what addiction is, rendering informational sections from imported education content in card components.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, container settings, border radius variables, font families, and animation keyframes.",
  "project_state.json": "Project metadata tracking one existing feature to hide the login icon/button from SiteHeader while preserving Internet Identity authentication functionality."
}